tdloe/tms320-rpi-serial/inc/hw_adc.h
//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOCFRC1 register
//
//*****************************************************************************
#define ADC_SOCFRC1_SOC0          0x1U         // SOC0 Force Start of
                                               // Conversion Bit
#define ADC_SOCFRC1_SOC1          0x2U         // SOC1 Force Start of
                                               // Conversion Bit
#define ADC_SOCFRC1_SOC2          0x4U         // SOC2 Force Start of
                                               // Conversion Bit
#define ADC_SOCFRC1_SOC3          0x8U         // SOC3 Force Start of
                                               // Conversion Bit
#define ADC_SOCFRC1_SOC4          0x10U        // SOC4 Force Start of
                                               // Conversion Bit
#define ADC_SOCFRC1_SOC5          0x20U        // SOC5 Force Start of
                                               // Conversion Bit
#define ADC_SOCFRC1_SOC6          0x40U        // SOC6 Force Start of
                                               // Conversion Bit
#define ADC_SOCFRC1_SOC7          0x80U        // SOC7 Force Start of
                                               // Conversion Bit
#define ADC_SOCFRC1_SOC8          0x100U       // SOC8 Force Start of
                                               // Conversion Bit
#define ADC_SOCFRC1_SOC9          0x200U       // SOC9 Force Start of
                                               // Conversion Bit
#define ADC_SOCFRC1_SOC10         0x400U       // SOC10 Force Start of
                                               // Conversion Bit
#define ADC_SOCFRC1_SOC11         0x800U       // SOC11 Force Start of
                                               // Conversion Bit
#define ADC_SOCFRC1_SOC12         0x1000U      // SOC12 Force Start of
                                               // Conversion Bit
#define ADC_SOCFRC1_SOC13         0x2000U      // SOC13 Force Start of
                                               // Conversion Bit
#define ADC_SOCFRC1_SOC14         0x4000U      // SOC14 Force Start of
                                               // Conversion Bit
#define ADC_SOCFRC1_SOC15         0x8000U      // SOC15 Force Start of
                                               // Conversion Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOCOVF1 register
//
//*****************************************************************************
#define ADC_SOCOVF1_SOC0          0x1U         // SOC0 Start of Conversion
                                               // Overflow Flag
#define ADC_SOCOVF1_SOC1          0x2U         // SOC1 Start of Conversion
                                               // Overflow Flag
#define ADC_SOCOVF1_SOC2          0x4U         // SOC2 Start of Conversion
                                               // Overflow Flag
#define ADC_SOCOVF1_SOC3          0x8U         // SOC3 Start of Conversion
                                               // Overflow Flag
#define ADC_SOCOVF1_SOC4          0x10U        // SOC4 Start of Conversion
                                               // Overflow Flag
#define ADC_SOCOVF1_SOC5          0x20U        // SOC5 Start of Conversion
                                               // Overflow Flag
#define ADC_SOCOVF1_SOC6          0x40U        // SOC6 Start of Conversion
                                               // Overflow Flag
#define ADC_SOCOVF1_SOC7          0x80U        // SOC7 Start of Conversion
                                               // Overflow Flag
#define ADC_SOCOVF1_SOC8          0x100U       // SOC8 Start of Conversion
                                               // Overflow Flag
#define ADC_SOCOVF1_SOC9          0x200U       // SOC9 Start of Conversion
                                               // Overflow Flag
#define ADC_SOCOVF1_SOC10         0x400U       // SOC10 Start of Conversion
                                               // Overflow Flag
#define ADC_SOCOVF1_SOC11         0x800U       // SOC11 Start of Conversion
                                               // Overflow Flag
#define ADC_SOCOVF1_SOC12         0x1000U      // SOC12 Start of Conversion
                                               // Overflow Flag
#define ADC_SOCOVF1_SOC13         0x2000U      // SOC13 Start of Conversion
                                               // Overflow Flag
#define ADC_SOCOVF1_SOC14         0x4000U      // SOC14 Start of Conversion
                                               // Overflow Flag
#define ADC_SOCOVF1_SOC15         0x8000U      // SOC15 Start of Conversion
                                               // Overflow Flag

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOCOVFCLR1 register
//
//*****************************************************************************
#define ADC_SOCOVFCLR1_SOC0       0x1U         // SOC0 Clear Start of
                                               // Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC1       0x2U         // SOC1 Clear Start of
                                               // Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC2       0x4U         // SOC2 Clear Start of
                                               // Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC3       0x8U         // SOC3 Clear Start of
                                               // Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC4       0x10U        // SOC4 Clear Start of
                                               // Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC5       0x20U        // SOC5 Clear Start of
                                               // Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC6       0x40U        // SOC6 Clear Start of
                                               // Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC7       0x80U        // SOC7 Clear Start of
                                               // Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC8       0x100U       // SOC8 Clear Start of
                                               // Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC9       0x200U       // SOC9 Clear Start of
                                               // Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC10      0x400U       // SOC10 Clear Start of
                                               // Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC11      0x800U       // SOC11 Clear Start of
                                               // Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC12      0x1000U      // SOC12 Clear Start of
                                               // Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC13      0x2000U      // SOC13 Clear Start of
                                               // Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC14      0x4000U      // SOC14 Clear Start of
                                               // Conversion Overflow Bit
#define ADC_SOCOVFCLR1_SOC15      0x8000U      // SOC15 Clear Start of
                                               // Conversion Overflow Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC0CTL register
//
//*****************************************************************************
#define ADC_SOC0CTL_ACQPS_S       0U
#define ADC_SOC0CTL_ACQPS_M       0x1FFU       // SOC0 Acquisition Prescale
#define ADC_SOC0CTL_CHSEL_S       15U
#define ADC_SOC0CTL_CHSEL_M       0x78000U     // SOC0 Channel Select
#define ADC_SOC0CTL_TRIGSEL_S     20U
#define ADC_SOC0CTL_TRIGSEL_M     0x1F00000U   // SOC0 Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC1CTL register
//
//*****************************************************************************
#define ADC_SOC1CTL_ACQPS_S       0U
#define ADC_SOC1CTL_ACQPS_M       0x1FFU       // SOC1 Acquisition Prescale
#define ADC_SOC1CTL_CHSEL_S       15U
#define ADC_SOC1CTL_CHSEL_M       0x78000U     // SOC1 Channel Select
#define ADC_SOC1CTL_TRIGSEL_S     20U
#define ADC_SOC1CTL_TRIGSEL_M     0x1F00000U   // SOC1 Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC2CTL register
//
//*****************************************************************************
#define ADC_SOC2CTL_ACQPS_S       0U
#define ADC_SOC2CTL_ACQPS_M       0x1FFU       // SOC2 Acquisition Prescale
#define ADC_SOC2CTL_CHSEL_S       15U
#define ADC_SOC2CTL_CHSEL_M       0x78000U     // SOC2 Channel Select
#define ADC_SOC2CTL_TRIGSEL_S     20U
#define ADC_SOC2CTL_TRIGSEL_M     0x1F00000U   // SOC2 Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC3CTL register
//
//*****************************************************************************
#define ADC_SOC3CTL_ACQPS_S       0U
#define ADC_SOC3CTL_ACQPS_M       0x1FFU       // SOC3 Acquisition Prescale
#define ADC_SOC3CTL_CHSEL_S       15U
#define ADC_SOC3CTL_CHSEL_M       0x78000U     // SOC3 Channel Select
#define ADC_SOC3CTL_TRIGSEL_S     20U
#define ADC_SOC3CTL_TRIGSEL_M     0x1F00000U   // SOC3 Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC4CTL register
//
//*****************************************************************************
#define ADC_SOC4CTL_ACQPS_S       0U
#define ADC_SOC4CTL_ACQPS_M       0x1FFU       // SOC4 Acquisition Prescale
#define ADC_SOC4CTL_CHSEL_S       15U
#define ADC_SOC4CTL_CHSEL_M       0x78000U     // SOC4 Channel Select
#define ADC_SOC4CTL_TRIGSEL_S     20U
#define ADC_SOC4CTL_TRIGSEL_M     0x1F00000U   // SOC4 Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC5CTL register
//
//*****************************************************************************
#define ADC_SOC5CTL_ACQPS_S       0U
#define ADC_SOC5CTL_ACQPS_M       0x1FFU       // SOC5 Acquisition Prescale
#define ADC_SOC5CTL_CHSEL_S       15U
#define ADC_SOC5CTL_CHSEL_M       0x78000U     // SOC5 Channel Select
#define ADC_SOC5CTL_TRIGSEL_S     20U
#define ADC_SOC5CTL_TRIGSEL_M     0x1F00000U   // SOC5 Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC6CTL register
//
//*****************************************************************************
#define ADC_SOC6CTL_ACQPS_S       0U
#define ADC_SOC6CTL_ACQPS_M       0x1FFU       // SOC6 Acquisition Prescale
#define ADC_SOC6CTL_CHSEL_S       15U
#define ADC_SOC6CTL_CHSEL_M       0x78000U     // SOC6 Channel Select
#define ADC_SOC6CTL_TRIGSEL_S     20U
#define ADC_SOC6CTL_TRIGSEL_M     0x1F00000U   // SOC6 Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC7CTL register
//
//*****************************************************************************
#define ADC_SOC7CTL_ACQPS_S       0U
#define ADC_SOC7CTL_ACQPS_M       0x1FFU       // SOC7 Acquisition Prescale
#define ADC_SOC7CTL_CHSEL_S       15U
#define ADC_SOC7CTL_CHSEL_M       0x78000U     // SOC7 Channel Select
#define ADC_SOC7CTL_TRIGSEL_S     20U
#define ADC_SOC7CTL_TRIGSEL_M     0x1F00000U   // SOC7 Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC8CTL register
//
//*****************************************************************************
#define ADC_SOC8CTL_ACQPS_S       0U
#define ADC_SOC8CTL_ACQPS_M       0x1FFU       // SOC8 Acquisition Prescale
#define ADC_SOC8CTL_CHSEL_S       15U
#define ADC_SOC8CTL_CHSEL_M       0x78000U     // SOC8 Channel Select
#define ADC_SOC8CTL_TRIGSEL_S     20U
#define ADC_SOC8CTL_TRIGSEL_M     0x1F00000U   // SOC8 Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC9CTL register
//
//*****************************************************************************
#define ADC_SOC9CTL_ACQPS_S       0U
#define ADC_SOC9CTL_ACQPS_M       0x1FFU       // SOC9 Acquisition Prescale
#define ADC_SOC9CTL_CHSEL_S       15U
#define ADC_SOC9CTL_CHSEL_M       0x78000U     // SOC9 Channel Select
#define ADC_SOC9CTL_TRIGSEL_S     20U
#define ADC_SOC9CTL_TRIGSEL_M     0x1F00000U   // SOC9 Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC10CTL register
//
//*****************************************************************************
#define ADC_SOC10CTL_ACQPS_S      0U
#define ADC_SOC10CTL_ACQPS_M      0x1FFU       // SOC10 Acquisition Prescale
#define ADC_SOC10CTL_CHSEL_S      15U
#define ADC_SOC10CTL_CHSEL_M      0x78000U     // SOC10 Channel Select
#define ADC_SOC10CTL_TRIGSEL_S    20U
#define ADC_SOC10CTL_TRIGSEL_M    0x1F00000U   // SOC10 Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC11CTL register
//
//*****************************************************************************
#define ADC_SOC11CTL_ACQPS_S      0U
#define ADC_SOC11CTL_ACQPS_M      0x1FFU       // SOC11 Acquisition Prescale
#define ADC_SOC11CTL_CHSEL_S      15U
#define ADC_SOC11CTL_CHSEL_M      0x78000U     // SOC11 Channel Select
#define ADC_SOC11CTL_TRIGSEL_S    20U
#define ADC_SOC11CTL_TRIGSEL_M    0x1F00000U   // SOC11 Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC12CTL register
//
//*****************************************************************************
#define ADC_SOC12CTL_ACQPS_S      0U
#define ADC_SOC12CTL_ACQPS_M      0x1FFU       // SOC12 Acquisition Prescale
#define ADC_SOC12CTL_CHSEL_S      15U
#define ADC_SOC12CTL_CHSEL_M      0x78000U     // SOC12 Channel Select
#define ADC_SOC12CTL_TRIGSEL_S    20U
#define ADC_SOC12CTL_TRIGSEL_M    0x1F00000U   // SOC12 Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC13CTL register
//
//*****************************************************************************
#define ADC_SOC13CTL_ACQPS_S      0U
#define ADC_SOC13CTL_ACQPS_M      0x1FFU       // SOC13 Acquisition Prescale
#define ADC_SOC13CTL_CHSEL_S      15U
#define ADC_SOC13CTL_CHSEL_M      0x78000U     // SOC13 Channel Select
#define ADC_SOC13CTL_TRIGSEL_S    20U
#define ADC_SOC13CTL_TRIGSEL_M    0x1F00000U   // SOC13 Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC14CTL register
//
//*****************************************************************************
#define ADC_SOC14CTL_ACQPS_S      0U
#define ADC_SOC14CTL_ACQPS_M      0x1FFU       // SOC14 Acquisition Prescale
#define ADC_SOC14CTL_CHSEL_S      15U
#define ADC_SOC14CTL_CHSEL_M      0x78000U     // SOC14 Channel Select
#define ADC_SOC14CTL_TRIGSEL_S    20U
#define ADC_SOC14CTL_TRIGSEL_M    0x1F00000U   // SOC14 Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC15CTL register
//
//*****************************************************************************
#define ADC_SOC15CTL_ACQPS_S      0U
#define ADC_SOC15CTL_ACQPS_M      0x1FFU       // SOC15 Acquisition Prescale
#define ADC_SOC15CTL_CHSEL_S      15U
#define ADC_SOC15CTL_CHSEL_M      0x78000U     // SOC15 Channel Select
#define ADC_SOC15CTL_TRIGSEL_S    20U
#define ADC_SOC15CTL_TRIGSEL_M    0x1F00000U   // SOC15 Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCEVTSTAT register
//
//*****************************************************************************
#define ADC_EVTSTAT_PPB1TRIPHI    0x1U         // Post Processing Block 1 Trip
                                               // High Flag
#define ADC_EVTSTAT_PPB1TRIPLO    0x2U         // Post Processing Block 1 Trip
                                               // Low Flag
#define ADC_EVTSTAT_PPB1ZERO      0x4U         // Post Processing Block 1 Zero
                                               // Crossing Flag
#define ADC_EVTSTAT_PPB2TRIPHI    0x10U        // Post Processing Block 2 Trip
                                               // High Flag
#define ADC_EVTSTAT_PPB2TRIPLO    0x20U        // Post Processing Block 2 Trip
                                               // Low Flag
#define ADC_EVTSTAT_PPB2ZERO      0x40U        // Post Processing Block 2 Zero
                                               // Crossing Flag
#define ADC_EVTSTAT_PPB3TRIPHI    0x100U       // Post Processing Block 3 Trip
                                               // High Flag
#define ADC_EVTSTAT_PPB3TRIPLO    0x200U       // Post Processing Block 3 Trip
                                               // Low Flag
#define ADC_EVTSTAT_PPB3ZERO      0x400U       // Post Processing Block 3 Zero
                                               // Crossing Flag
#define ADC_EVTSTAT_PPB4TRIPHI    0x1000U      // Post Processing Block 4 Trip
                                               // High Flag
#define ADC_EVTSTAT_PPB4TRIPLO    0x2000U      // Post Processing Block 4 Trip
                                               // Low Flag
#define ADC_EVTSTAT_PPB4ZERO      0x4000U      // Post Processing Block 4 Zero
                                               // Crossing Flag

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCEVTCLR register
//
//*****************************************************************************
#define ADC_EVTCLR_PPB1TRIPHI     0x1U         // Post Processing Block 1 Trip
                                               // High Clear
#define ADC_EVTCLR_PPB1TRIPLO     0x2U         // Post Processing Block 1 Trip
                                               // Low Clear
#define ADC_EVTCLR_PPB1ZERO       0x4U         // Post Processing Block 1 Zero
                                               // Crossing Clear
#define ADC_EVTCLR_PPB2TRIPHI     0x10U        // Post Processing Block 2 Trip
                                               // High Clear
#define ADC_EVTCLR_PPB2TRIPLO     0x20U        // Post Processing Block 2 Trip
                                               // Low Clear
#define ADC_EVTCLR_PPB2ZERO       0x40U        // Post Processing Block 2 Zero
                                               // Crossing Clear
#define ADC_EVTCLR_PPB3TRIPHI     0x100U       // Post Processing Block 3 Trip
                                               // High Clear
#define ADC_EVTCLR_PPB3TRIPLO     0x200U       // Post Processing Block 3 Trip
                                               // Low Clear
#define ADC_EVTCLR_PPB3ZERO       0x400U       // Post Processing Block 3 Zero
                                               // Crossing Clear
#define ADC_EVTCLR_PPB4TRIPHI     0x1000U      // Post Processing Block 4 Trip
                                               // High Clear
#define ADC_EVTCLR_PPB4TRIPLO     0x2000U      // Post Processing Block 4 Trip
                                               // Low Clear
#define ADC_EVTCLR_PPB4ZERO       0x4000U      // Post Processing Block 4 Zero
                                               // Crossing Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCEVTSEL register
//
//*****************************************************************************
#define ADC_EVTSEL_PPB1TRIPHI     0x1U         // Post Processing Block 1 Trip
                                               // High Event Enable
#define ADC_EVTSEL_PPB1TRIPLO     0x2U         // Post Processing Block 1 Trip
                                               // Low Event Enable
#define ADC_EVTSEL_PPB1ZERO       0x4U         // Post Processing Block 1 Zero
                                               // Crossing Event Enable
#define ADC_EVTSEL_PPB2TRIPHI     0x10U        // Post Processing Block 2 Trip
                                               // High Event Enable
#define ADC_EVTSEL_PPB2TRIPLO     0x20U        // Post Processing Block 2 Trip
                                               // Low Event Enable
#define ADC_EVTSEL_PPB2ZERO       0x40U        // Post Processing Block 2 Zero
                                               // Crossing Event Enable
#define ADC_EVTSEL_PPB3TRIPHI     0x100U       // Post Processing Block 3 Trip
                                               // High Event Enable
#define ADC_EVTSEL_PPB3TRIPLO     0x200U       // Post Processing Block 3 Trip
                                               // Low Event Enable
#define ADC_EVTSEL_PPB3ZERO       0x400U       // Post Processing Block 3 Zero
                                               // Crossing Event Enable
#define ADC_EVTSEL_PPB4TRIPHI     0x1000U      // Post Processing Block 4 Trip
                                               // High Event Enable
#define ADC_EVTSEL_PPB4TRIPLO     0x2000U      // Post Processing Block 4 Trip
                                               // Low Event Enable
#define ADC_EVTSEL_PPB4ZERO       0x4000U      // Post Processing Block 4 Zero
                                               // Crossing Event Enable

