tdloe/tms320-rpi-serial/inc/hw_adc.h
//*****************************************************************************
//
// The following are defines for the bit fields in the ADCEVTINTSEL register
//
//*****************************************************************************
#define ADC_EVTINTSEL_PPB1TRIPHI  0x1U         // Post Processing Block 1 Trip
                                               // High Interrupt Enable
#define ADC_EVTINTSEL_PPB1TRIPLO  0x2U         // Post Processing Block 1 Trip
                                               // Low Interrupt Enable
#define ADC_EVTINTSEL_PPB1ZERO    0x4U         // Post Processing Block 1 Zero
                                               // Crossing Interrupt Enable
#define ADC_EVTINTSEL_PPB2TRIPHI  0x10U        // Post Processing Block 2 Trip
                                               // High Interrupt Enable
#define ADC_EVTINTSEL_PPB2TRIPLO  0x20U        // Post Processing Block 2 Trip
                                               // Low Interrupt Enable
#define ADC_EVTINTSEL_PPB2ZERO    0x40U        // Post Processing Block 2 Zero
                                               // Crossing Interrupt Enable
#define ADC_EVTINTSEL_PPB3TRIPHI  0x100U       // Post Processing Block 3 Trip
                                               // High Interrupt Enable
#define ADC_EVTINTSEL_PPB3TRIPLO  0x200U       // Post Processing Block 3 Trip
                                               // Low Interrupt Enable
#define ADC_EVTINTSEL_PPB3ZERO    0x400U       // Post Processing Block 3 Zero
                                               // Crossing Interrupt Enable
#define ADC_EVTINTSEL_PPB4TRIPHI  0x1000U      // Post Processing Block 4 Trip
                                               // High Interrupt Enable
#define ADC_EVTINTSEL_PPB4TRIPLO  0x2000U      // Post Processing Block 4 Trip
                                               // Low Interrupt Enable
#define ADC_EVTINTSEL_PPB4ZERO    0x4000U      // Post Processing Block 4 Zero
                                               // Crossing Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCOSDETECT register
//
//*****************************************************************************
#define ADC_OSDETECT_DETECTCFG_S  0U
#define ADC_OSDETECT_DETECTCFG_M  0x7U         // ADC Opens and Shorts Detect
                                               // Configuration

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCCOUNTER register
//
//*****************************************************************************
#define ADC_COUNTER_FREECOUNT_S   0U
#define ADC_COUNTER_FREECOUNT_M   0xFFFU       // ADC Free Running Counter
                                               // Value

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCREV register
//
//*****************************************************************************
#define ADC_REV_TYPE_S            0U
#define ADC_REV_TYPE_M            0xFFU        // ADC Type
#define ADC_REV_REV_S             8U
#define ADC_REV_REV_M             0xFF00U      // ADC Revision

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCOFFTRIM register
//
//*****************************************************************************
#define ADC_OFFTRIM_OFFTRIM_S     0U
#define ADC_OFFTRIM_OFFTRIM_M     0xFFU        // ADC Offset Trim

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1CONFIG register
//
//*****************************************************************************
#define ADC_PPB1CONFIG_CONFIG_S   0U
#define ADC_PPB1CONFIG_CONFIG_M   0xFU         // ADC Post Processing Block 1
                                               // Configuration
#define ADC_PPB1CONFIG_TWOSCOMPEN  0x10U        // ADC Post Processing Block 1
                                               // Two's Complement Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1STAMP register
//
//*****************************************************************************
#define ADC_PPB1STAMP_DLYSTAMP_S  0U
#define ADC_PPB1STAMP_DLYSTAMP_M  0xFFFU       // ADC Post Processing Block 1
                                               // Delay Time Stamp

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1OFFCAL register
//
//*****************************************************************************
#define ADC_PPB1OFFCAL_OFFCAL_S   0U
#define ADC_PPB1OFFCAL_OFFCAL_M   0x3FFU       // ADC Post Processing Block
                                               // Offset Correction

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1TRIPHI register
//
//*****************************************************************************
#define ADC_PPB1TRIPHI_LIMITHI_S  0U
#define ADC_PPB1TRIPHI_LIMITHI_M  0xFFFFU      // ADC Post Processing Block 1
                                               // Trip High Limit
#define ADC_PPB1TRIPHI_HSIGN      0x10000U     // High Limit Sign Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1TRIPLO register
//
//*****************************************************************************
#define ADC_PPB1TRIPLO_LIMITLO_S  0U
#define ADC_PPB1TRIPLO_LIMITLO_M  0xFFFFU      // ADC Post Processing Block 1
                                               // Trip Low Limit
#define ADC_PPB1TRIPLO_LSIGN      0x10000U     // Low Limit Sign Bit
#define ADC_PPB1TRIPLO_REQSTAMP_S  20U
#define ADC_PPB1TRIPLO_REQSTAMP_M  0xFFF00000U  // ADC Post Processing Block 1
                                               // Request Time Stamp

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2CONFIG register
//
//*****************************************************************************
#define ADC_PPB2CONFIG_CONFIG_S   0U
#define ADC_PPB2CONFIG_CONFIG_M   0xFU         // ADC Post Processing Block 2
                                               // Configuration
#define ADC_PPB2CONFIG_TWOSCOMPEN  0x10U        // ADC Post Processing Block 2
                                               // Two's Complement Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2STAMP register
//
//*****************************************************************************
#define ADC_PPB2STAMP_DLYSTAMP_S  0U
#define ADC_PPB2STAMP_DLYSTAMP_M  0xFFFU       // ADC Post Processing Block 2
                                               // Delay Time Stamp

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2OFFCAL register
//
//*****************************************************************************
#define ADC_PPB2OFFCAL_OFFCAL_S   0U
#define ADC_PPB2OFFCAL_OFFCAL_M   0x3FFU       // ADC Post Processing Block
                                               // Offset Correction

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2TRIPHI register
//
//*****************************************************************************
#define ADC_PPB2TRIPHI_LIMITHI_S  0U
#define ADC_PPB2TRIPHI_LIMITHI_M  0xFFFFU      // ADC Post Processing Block 2
                                               // Trip High Limit
#define ADC_PPB2TRIPHI_HSIGN      0x10000U     // High Limit Sign Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2TRIPLO register
//
//*****************************************************************************
#define ADC_PPB2TRIPLO_LIMITLO_S  0U
#define ADC_PPB2TRIPLO_LIMITLO_M  0xFFFFU      // ADC Post Processing Block 2
                                               // Trip Low Limit
#define ADC_PPB2TRIPLO_LSIGN      0x10000U     // Low Limit Sign Bit
#define ADC_PPB2TRIPLO_REQSTAMP_S  20U
#define ADC_PPB2TRIPLO_REQSTAMP_M  0xFFF00000U  // ADC Post Processing Block 2
                                               // Request Time Stamp

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB3CONFIG register
//
//*****************************************************************************
#define ADC_PPB3CONFIG_CONFIG_S   0U
#define ADC_PPB3CONFIG_CONFIG_M   0xFU         // ADC Post Processing Block 3
                                               // Configuration
#define ADC_PPB3CONFIG_TWOSCOMPEN  0x10U        // ADC Post Processing Block 3
                                               // Two's Complement Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB3STAMP register
//
//*****************************************************************************
#define ADC_PPB3STAMP_DLYSTAMP_S  0U
#define ADC_PPB3STAMP_DLYSTAMP_M  0xFFFU       // ADC Post Processing Block 3
                                               // Delay Time Stamp

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB3OFFCAL register
//
//*****************************************************************************
#define ADC_PPB3OFFCAL_OFFCAL_S   0U
#define ADC_PPB3OFFCAL_OFFCAL_M   0x3FFU       // ADC Post Processing Block
                                               // Offset Correction

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB3TRIPHI register
//
//*****************************************************************************
#define ADC_PPB3TRIPHI_LIMITHI_S  0U
#define ADC_PPB3TRIPHI_LIMITHI_M  0xFFFFU      // ADC Post Processing Block 3
                                               // Trip High Limit
#define ADC_PPB3TRIPHI_HSIGN      0x10000U     // High Limit Sign Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB3TRIPLO register
//
//*****************************************************************************
#define ADC_PPB3TRIPLO_LIMITLO_S  0U
#define ADC_PPB3TRIPLO_LIMITLO_M  0xFFFFU      // ADC Post Processing Block 3
                                               // Trip Low Limit
#define ADC_PPB3TRIPLO_LSIGN      0x10000U     // Low Limit Sign Bit
#define ADC_PPB3TRIPLO_REQSTAMP_S  20U
#define ADC_PPB3TRIPLO_REQSTAMP_M  0xFFF00000U  // ADC Post Processing Block 3
                                               // Request Time Stamp

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB4CONFIG register
//
//*****************************************************************************
#define ADC_PPB4CONFIG_CONFIG_S   0U
#define ADC_PPB4CONFIG_CONFIG_M   0xFU         // ADC Post Processing Block 4
                                               // Configuration
#define ADC_PPB4CONFIG_TWOSCOMPEN  0x10U        // ADC Post Processing Block 4
                                               // Two's Complement Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB4STAMP register
//
//*****************************************************************************
#define ADC_PPB4STAMP_DLYSTAMP_S  0U
#define ADC_PPB4STAMP_DLYSTAMP_M  0xFFFU       // ADC Post Processing Block 4
                                               // Delay Time Stamp

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB4OFFCAL register
//
//*****************************************************************************
#define ADC_PPB4OFFCAL_OFFCAL_S   0U
#define ADC_PPB4OFFCAL_OFFCAL_M   0x3FFU       // ADC Post Processing Block
                                               // Offset Correction

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB4TRIPHI register
//
//*****************************************************************************
#define ADC_PPB4TRIPHI_LIMITHI_S  0U
#define ADC_PPB4TRIPHI_LIMITHI_M  0xFFFFU      // ADC Post Processing Block 4
                                               // Trip High Limit
#define ADC_PPB4TRIPHI_HSIGN      0x10000U     // High Limit Sign Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB4TRIPLO register
//
//*****************************************************************************
#define ADC_PPB4TRIPLO_LIMITLO_S  0U
#define ADC_PPB4TRIPLO_LIMITLO_M  0xFFFFU      // ADC Post Processing Block 4
                                               // Trip Low Limit
#define ADC_PPB4TRIPLO_LSIGN      0x10000U     // Low Limit Sign Bit
#define ADC_PPB4TRIPLO_REQSTAMP_S  20U
#define ADC_PPB4TRIPLO_REQSTAMP_M  0xFFF00000U  // ADC Post Processing Block 4
                                               // Request Time Stamp

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1RESULT register
//
//*****************************************************************************
#define ADC_PPB1RESULT_PPBRESULT_S  0U
#define ADC_PPB1RESULT_PPBRESULT_M  0xFFFFU      // ADC Post Processing Block
                                               // Result
#define ADC_PPB1RESULT_SIGN_S     16U
#define ADC_PPB1RESULT_SIGN_M     0xFFFF0000U  // Sign Extended Bits

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB2RESULT register
//
//*****************************************************************************
#define ADC_PPB2RESULT_PPBRESULT_S  0U
#define ADC_PPB2RESULT_PPBRESULT_M  0xFFFFU      // ADC Post Processing Block
                                               // Result
#define ADC_PPB2RESULT_SIGN_S     16U
#define ADC_PPB2RESULT_SIGN_M     0xFFFF0000U  // Sign Extended Bits

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB3RESULT register
//
//*****************************************************************************
#define ADC_PPB3RESULT_PPBRESULT_S  0U
#define ADC_PPB3RESULT_PPBRESULT_M  0xFFFFU      // ADC Post Processing Block
                                               // Result
#define ADC_PPB3RESULT_SIGN_S     16U
#define ADC_PPB3RESULT_SIGN_M     0xFFFF0000U  // Sign Extended Bits

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB4RESULT register
//
//*****************************************************************************
#define ADC_PPB4RESULT_PPBRESULT_S  0U
#define ADC_PPB4RESULT_PPBRESULT_M  0xFFFFU      // ADC Post Processing Block
                                               // Result
#define ADC_PPB4RESULT_SIGN_S     16U
#define ADC_PPB4RESULT_SIGN_M     0xFFFF0000U  // Sign Extended Bits
#endif
